## Basic pandas with Series and DataFrame

In [1]:
# import necessary libraries
import pandas as pd

In [2]:
# Create a simple list
data = [1,2,3,4,5]

In [3]:
# print the list
data

[1, 2, 3, 4, 5]

In [4]:
# Check the type of the data
type(data)

list

In [5]:
# Convert the list to a pandas Series
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
# Check the type of the Series
type(s)

pandas.core.series.Series

In [7]:
# Create a DataFrame from the Series
df = pd.DataFrame(s, columns=['num'])
df

   num
0    1
1    2
2    3
3    4
4    5

In [8]:
# Create a DataFrame from list
df1 = pd.DataFrame(data, columns=['num2'])
df1

   num2
0     1
1     2
2     3
3     4
4     5

In [9]:
# Convert the Series to a DataFrame
s2 = df1['num2']
s2

0    1
1    2
2    3
3    4
4    5
Name: num2, dtype: int64

In [10]:
# Check the type of the Series converted to DataFrame
type(s2)

pandas.core.series.Series

In [11]:
# Create list
data = [[1,2],[3,4],[5,6]]
data

[[1, 2], [3, 4], [5, 6]]

In [12]:
# Create a DataFrame from the list
df = pd.DataFrame(data, columns=['num1', 'num2'])
df

   num1  num2
0     1     2
1     3     4
2     5     6

In [13]:
# Select specific columns from the DataFrame
s = df[['num1', 'num2']]
s

   num1  num2
0     1     2
1     3     4
2     5     6

In [14]:
type(s)

pandas.core.frame.DataFrame

## Dictionary to series and DataFrame

In [15]:
# import necessary libraries
import pandas as pd

In [16]:
# create a dictionary with data
data = {
    'name' : ['Alice', 'Bob', 'Charlie'],
    'age' : [25, 30, 35],
    'city' : ['New York', 'Los Angeles', 'Chicago']
}
data

{'name': ['Alice', 'Bob', 'Charlie'],
 'age': [25, 30, 35],
 'city': ['New York', 'Los Angeles', 'Chicago']}

In [17]:
# create a Series for name from the dictionary
name_series = pd.Series(data['name'], name='name')
name_series

0      Alice
1        Bob
2    Charlie
Name: name, dtype: object

In [18]:
# create a DataFrame for age
df = pd.DataFrame(data)
df

      name  age         city
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [19]:
# Create a Series for age
age_series = pd.Series(data['age'], name='age')
age_series

0    25
1    30
2    35
Name: age, dtype: int64

## Set to Series and DataFrame

In [20]:
# import necessary libraries
import pandas as pd

In [21]:
# Create a set
s1 = {1,2,3,4,3,2,1}
s1

{1, 2, 3, 4}

In [22]:
# Check the type of the set
type(s1)

set

In [23]:
# Convert the set to list and convert into a pandas Series
s = pd.Series(list(s1))
s

0    1
1    2
2    3
3    4
dtype: int64

In [24]:
# Create a DataFrame from the set
df = pd.DataFrame(s1, columns=['set_value'] )
df

   set_value
0          1
1          2
2          3
3          4

## Tuple to Series and DataFrame

In [25]:
t = (1,2,4,5,6,7,8, True, False, 'hello', 'world')
s = pd.Series(t)
s

0         1
1         2
2         4
3         5
4         6
5         7
6         8
7      True
8     False
9     hello
10    world
dtype: object

In [26]:
df = pd.DataFrame(t, columns = ['tuple_value'])
df

   tuple_value
0            1
1            2
2            4
3            5
4            6
5            7
6            8
7         True
8        False
9        hello
10       world

In [27]:
# Check the DataFrame information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 1 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   tuple_value  11 non-null     object
dtypes: object(1)
memory usage: 220.0+ bytes

## Numeric Data Type in Pandas

In [28]:
import pandas as pd

In [29]:
# creating DataFrame with integer data
date = {
    'age': [25, 30, 35],
    'salary': [50000, 60000, 70000],
}
df = pd.DataFrame(date)
df

   age  salary
0   25   50000
1   30   60000
2   35   70000

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     3 non-null      int64
 1   salary  3 non-null      int64
dtypes: int64(2)
memory usage: 180.0 bytes

In [31]:
df.dtypes

age       int64
salary    int64
dtype: object

In [32]:
# changing the data type to int32
df['age'] = df['age'].astype('int32')
df['salary'] = df['salary'].astype('int32')
df

   age  salary
0   25   50000
1   30   60000
2   35   70000

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     3 non-null      int32
 1   salary  3 non-null      int32
dtypes: int32(2)
memory usage: 156.0 bytes

In [34]:
2**32

4294967296

In [35]:
2**32/2

2147483648.0

In [36]:
# changing the data type to int16
df['age'] = df['age'].astype('int16')
df['salary'] = df['salary'].astype('int16')
df

   age  salary
0   25  -15536
1   30   -5536
2   35    4464

In [37]:
2**15

32768

In [38]:
# creating DataFrame with integer data
date = {
    'age': [25, 30, 35],
    'salary': [50000, 60000, 70000],
}
df = pd.DataFrame(date)
df

   age  salary
0   25   50000
1   30   60000
2   35   70000

In [39]:
# changing the data type to float64
df['age'] = df['age'].astype('float64')
df['salary'] = df['salary'].astype('float64')
df

    age   salary
0  25.0  50000.0
1  30.0  60000.0
2  35.0  70000.0

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     3 non-null      float64
 1   salary  3 non-null      float64
dtypes: float64(2)
memory usage: 180.0 bytes

## Object, Datetime Datatype

In [41]:
import pandas as pd

In [42]:
data = {
    'name': ['Alice', 'Bob', 'Charlie'],
    'age': [25, 30, 35],
    'city': ['New York', 'Los Angeles', 'Chicago'],
    'join_date': ['2020-01-01', '2021-02-15', '2019-03-20']
}
data

{'name': ['Alice', 'Bob', 'Charlie'],
 'age': [25, 30, 35],
 'city': ['New York', 'Los Angeles', 'Chicago'],
 'join_date': ['2020-01-01', '2021-02-15', '2019-03-20']}

In [43]:
df = pd.DataFrame(data)
print(df.dtypes)

name         object
age           int64
city         object
join_date    object
dtype: object

In [44]:
df

      name  age         city   join_date
0    Alice   25     New York  2020-01-01
1      Bob   30  Los Angeles  2021-02-15
2  Charlie   35      Chicago  2019-03-20

In [45]:
# create a list of dates
dates = ['2020-01-01', '2021-02-15', '2019-03-20']
# create a DataFrame with dates
df_dates = pd.DataFrame({'dates': dates})
df_dates

        dates
0  2020-01-01
1  2021-02-15
2  2019-03-20

In [46]:
# check the data types of the DataFrame
df_dates['dates'].dtype

dtype('O')

In [47]:
# covert the 'dates' column to datetime
timestamps = pd.to_datetime(dates)
df2 = pd.DataFrame({'dates': timestamps})
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   dates   3 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 156.0 bytes

In [48]:
df2

       dates
0 2020-01-01
1 2021-02-15
2 2019-03-20

In [49]:
import pandas as pd

# create a list of dates
dates = ['2020', '2021-05-9', '2019']

# create a DataFrame with dates
# df_dates = pd.DataFrame({'dates': dates})

# convert the list to datetime
timestamps = pd.to_datetime(dates, format='mixed')

# create a new DataFrame with datetime values
df2 = pd.DataFrame({'dates2': timestamps})

# check the data type of the 'dates2' column
print(df2['dates2'].dtype)


# print(dates)
# timestamps = pd.to_datetime(dates, errors='coerce')
# invalid_dates = df_dates[pd.to_datetime(df_dates['dates'], errors='coerce').isna()]
# print("Invalid dates:", invalid_dates)
# timestamps = pd.to_datetime(dates, format = '%Y-%m-%d', errors='coerce')
# timestamps

datetime64[ns]

In [50]:
df2['dates2'].dtype

dtype('<M8[ns]')

In [51]:
df2

      dates2
0 2020-01-01
1 2021-05-09
2 2019-01-01

In [52]:
datetime = ['2020-10-01 12:00:00.2521414484', '2021-05-09 14:30:00.1234567890', '2019-03-20 08:15:30.9876543210']
timestamps = pd.to_datetime(datetime)
df = pd.DataFrame({'datetime': timestamps})

In [53]:
print(df['datetime'].dtype)

datetime64[ns]

In [54]:
df

                       datetime
0 2020-10-01 12:00:00.252141448
1 2021-05-09 14:30:00.123456789
2 2019-03-20 08:15:30.987654321

In [55]:
timestamps = pd.to_datetime(datetime)
series = pd.Series(timestamps)
series

0   2020-10-01 12:00:00.252141448
1   2021-05-09 14:30:00.123456789
2   2019-03-20 08:15:30.987654321
dtype: datetime64[ns]

In [56]:
series.info()

<class 'pandas.core.series.Series'>
RangeIndex: 3 entries, 0 to 2
Series name: None
Non-Null Count  Dtype
--------------  -----
3 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 156.0 bytes

### Pandas library
Useful for Data Processing & Analysis

Pandas DataFrame:
Pandas DataFrame is two-dimensional tabular data structure with labeled axes (rows and columns).

In [58]:
import numpy as np
labels = ['a', 'b', 'c']
my_data = [1, 2, 3]
arr = np.array(my_data)
d = {'a': 1, 'b': 2, 'c': 3}

In [59]:
pd.Series(data=my_data, index=labels)

a    1
b    2
c    3
dtype: int64

In [60]:
d

{'a': 1, 'b': 2, 'c': 3}

In [62]:
type(d)

dict

In [63]:
pd.Series(arr)

0    1
1    2
2    3
dtype: int32

In [64]:
pd.Series(arr,labels)

a    1
b    2
c    3
dtype: int32

In [65]:
pd.Series(d)

a    1
b    2
c    3
dtype: int64

In [66]:
pd.Series(my_data)

0    1
1    2
2    3
dtype: int64

In [67]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [69]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [70]:
ser1 = pd.Series([1,2,3,4], ['USA', 'Germany', 'USSR', 'Japan'])

In [71]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [74]:
ser2 = pd.Series([1,2,5,4], ['USA', 'Germany', 'Italy', 'Japan'])

In [75]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [76]:
ser1[1]

C:\Users\rashe\AppData\Local\Temp\ipykernel_16440\2158219610.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser1[1]

2

In [77]:
ser1['Germany']

2

In [78]:
ser3 = pd.Series(data=labels)

In [79]:
ser3

0    a
1    b
2    c
dtype: object

In [80]:
ser3[0]

'a'

In [81]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [82]:
from numpy.random import randn

***np.random.seed(101)*** : when we execute the random method for more than one time the number sequence always be change but when we use the ***np.random.seed(101)*** method the sequence will be not change......

In [92]:
np.random.seed(101)

In [93]:
df = pd.DataFrame(randn(5,4),['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [94]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [95]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [98]:
df['Z']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [99]:
type(df)

pandas.core.frame.DataFrame

In [100]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [102]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 372.0+ bytes

In [103]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [104]:
df['new'] = df['W'] + df['Z']

In [105]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [108]:
df.drop('new', axis=1, inplace=True)

In [109]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [110]:
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [111]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [112]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [114]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [115]:
df.shape

(5, 4)

In [119]:
df.loc[['A','B'],['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965

In [124]:
booldf = df > 0

In [125]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [127]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [128]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [129]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [131]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [132]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [133]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [134]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [135]:
result = df[df['W']>0]

In [136]:
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [137]:
result['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [139]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [140]:
df[df['W'] > 0][['X', 'Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [141]:
boolser = df['W']>0

In [142]:
bool

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [144]:
boolser

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [145]:
result = df[boolser]
mycols = ['Y', 'X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [148]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [149]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [150]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [152]:
newindex = 'CA NY WY OR CO'.split()
newindex

['CA', 'NY', 'WY', 'OR', 'CO']

In [153]:
df['States'] = newindex

In [154]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [155]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [156]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [157]:
import pandas as pd
import numpy as np

In [158]:
# index level 
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [159]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [160]:
inside

[1, 2, 3, 1, 2, 3]

In [161]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [162]:
list(zip(outside, inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [163]:
df = pd.DataFrame(randn(6,2), hier_index,['A', 'B'])

In [164]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [165]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [167]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [168]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [169]:
df.index.names

FrozenList([None, None])

In [170]:
df.index.names = ['Groups', 'Num']

In [171]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [173]:
df.loc['G2'].loc[2].loc['B']

0.07295967531703869

In [174]:
df.loc['G1'].loc[1].loc['A']

0.3026654485851825

In [175]:
df.xs

<bound method NDFrame.xs of                    A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646>

In [176]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [177]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502